[
  {
    "namaResep": "Gelato Choco",
    "bahan": "Kuning telur 4 butir\nGula pasir 8 sdm\nSusu cair full fat 450 ml\nTepung maizena 1 sdm\nChocolatos bubuk 2 sachet\nGaram halus secukupnya\nTopping sesuai selera",
    "langkahMemasak": "1. Untuk memasak, persiapkan panci. Masukkan susu cair dan tambahkan tepung maizena. Aduk-aduk hingga rata dan masak selama 1 menit dengan api kecil. Jangan sampai panas, cukup masak hangat kuku saja.\n2. Campurkan adonan maizena dan susu tersebut dengan adonan gula dan telur yang sudah di mixer selama 10 menit. Masukkan coklat bubuk dan aduk hingga merata secara perlahan.\n3. Jika sudah dingin, tuang ke dalam wadah atau loyang dan simpan dalam freezer hingga setengah beku, kurang lebih 3 jam.\n4. Jika sudah setengah beku, aduk dengan garpu. Keluarkan dari wadah dan pindahkan ke wadah lainnya. Menggunakan kecepatan tinggi, mixer selama 10 menit hingga menjadi lembut.\n5. Selanjutnya tuang ke dalam panci dan masak dengan api kecil. Teruslah mengaduk hingga kental dan mendidih. Diamkan hingga dingin.\n6. Jika sudah dingin, tuang ke dalam loyang dan tambahkan topping. Masukkan ke dalam freezer dan bekukan 6 jam atau lebih. Ice Cream Gelato Choco siap dihidangkan.",
    "namaGambar": "gelato_choco",
    "kategori": "Es Krim"
  },
  {
    "namaResep": "Sorbet Mangga",
    "bahan": "500g daging buah mangga\n250ml Buavita orange\n1 sdm air jeruk lemon\n2 sdm madu",
    "langkahMemasak": "1. Potong-potong buah mangga, bekukan dalam freezer. Sisihkan.\n2. Siapkan wadah plastik beserta tutupnya untuk membekukan gelato. Sisihkan.\n3. Masukkan Buavita Orange, daging buah mangga, madu, dan air jeruk lemon ke dalam blender. Proses hingga halus.\n4. Tuang ke dalam wadah. Simpan dalam freezer selama 40 menit hingga mengeras. Keluarkan.\n5. Tusuk-tusuk, lalu aduk menggunakan garpu.\n6. Bekukan kembali selama 30-40 menit. Ulangi proses tusuk-tusuk dan aduk menggunakan garpu. Kemudian simpan kembali dalam freezer selama 30-40 menit. Sajikan.",
    "namaGambar": "sorbet_mangga",
    "kategori": "Es Krim"
  },
  {
    "namaResep": "Mochi Es Krim",
    "bahan": "1 cup es cream sesuai selera\n100 gr tepung maizena sangrai\n100 tepung beras ketan\n60 gr gula pasir\n1 sdm tepung maizena\n125-150 ml susu cair plain",
    "langkahMemasak": "1. Pertama ambil secukupnya es cream sesuai selera bungkus dengan plastik wrap kemudian masukan kedalam kulkas freezer sebentar.\n2. Masukkan susu cair ke panci, tepung beras ketan, gula pasir, tepung maizena, kedalam teplon masak aduk sampai rata. Jika sudah adonan seperti di gambar, angkat dan lumuri tepung maizena sangrai di atas wadah.\n3. Gulung adonan, kemudian cetak adonan sesuai selera agan, bungkus dengan plastik wrap, masukan es cream yg sudah di bekukan, kemudian bungkus kembali mochi, masukkan kulkas freezer sebentar.\n4. Ketika sudah membeku ambil mochi es cream dan siap di hidangkan.\nSelamat mencoba.",
    "namaGambar": "mochi_es_krim",
    "kategori": "Es Krim"
  },
  {
    "namaResep": "Banana Split",
    "bahan": "5 buah pisang lampung kecil\nSegepeas es krim vanilla secukupnya\nKeju secukupnya\nMesis secukupnya\n2 buah astor coklat",
    "langkahMemasak": "1. Kupas pisang dan kulitnya lalu potong.\n2. Beri es krim vanilla di atasnya. Beri keju parut diatasnya.\n3. Beri juga taburan meses sesuai selera serta beri toping astor sebagai tambahan. Sajikan.",
    "namaGambar": "banana_split",
    "kategori": "Es Krim"
  },
  {
    "namaResep": "Cookies and Cream",
    "bahan": "110 gr mentega\n140 gr gula castor\n1 butir telur\n1/2 sdt vanila extract\nSecubit garam\n1/2 sdt baking soda\n210 gr tepung terigu serbaguna\n10 keping oreo",
    "langkahMemasak": "1. Siapkan semua bahan. Lelehkan mentega, dan pindahkan ke dalam wadah bersih.\n2. Campurkan gula kedalam mentega leleh, kemudian aduk menggunakan whisker.\n3. Tambahkan vanila extract dan sedikit garam. Aduk rata. Masukkan telur, kocok sampai rata dengan whisker.\n4. Masukkan tepung terigu dan baking soda, aduk rata.\n5. Tambahkan oreo yg sudah di hancurkan. Aduk rata. Simpan di kulkas selama 20 menit.\n6. Bentuk bulat atau menggunakan scoop ice cream. Tata di loyang beri toping oreo di atasnya.\n7. Panggang di oven selama 15 menit dengan suhu 170 derajat atau sesuai suhu oven masing. Setelah matang keluarkan dari oven.\n8. Soft cookies & cream siap di santap bersama si kecil.",
    "namaGambar": "cookies_and_cream",
    "kategori": "Es Krim"
  },
  {
    "namaResep": "Frozen Yogurt",
    "bahan": "100 gr strobery beku\n400 ml yogurt plain\n2 sdm madu",
    "langkahMemasak": "1. Siapkan bahan-bahan untuk membuat froyo strobery.\n2. Masukkan strobery beku, madu dan yogurt kedalam gelas blender. Lalu proses hingga halus.\n3. Tuang hasil blender ke dalam wadah. Tutup rapat lalu masukkan kedalam freezer. Tunggu hingga beku, lalu keluarkan dari freezer. Frozen yogurt strobery siap dinikmati.",
    "namaGambar": "frozen_yogurt",
    "kategori": "Es Krim"
  },
  {
    "namaResep": "Strawberry Milkshake",
    "bahan": "100 ml susu uht\n3 sdm selai strawberry\n3 sdm skm\nSecukupnya batu es",
    "langkahMemasak": "1. Campur selai strawberry, skm, susu uht dan batu es kocok/blender hingga merata.\n2. Siapkan gelas, tuang sedikit selai strawberry kedalamnya kemudian tuang strawberry milkshake nya.\n3. Siap disajikan.",
    "namaGambar": "strawberry_milkshake",
    "kategori": "Minuman"
  },
  {
    "namaResep": "Strawberry Matcha Latte",
    "bahan": "30 g Selai strawberry\n10 g Simple syrup\n50 g ICEHOT Non Dairy Creamer\n100 g Es batu\n4 g Matcha bubuk\n30 g Air\n150 g Susu cair",
    "langkahMemasak": "1. Seduh matcha bubuk dengan air, aduk hingga larut dan berbuih.\n2. Tuang selai strawberry ke dalam gelas.\n3. Masukkan es batu.\n4. Tuang susu cair, ICEHOT Non Dairy Creamer dan simple syrup.\n5. Tuang matcha di atasnya sebagai toping.\n6. Strawberry matcha latte siap dinikmati.",
    "namaGambar": "strawberry_matcha_latte",
    "kategori": "Minuman"
  },
  {
    "namaResep": "Es Teler",
    "bahan": "2 buah alpukat uk besar\n2 buah kelapa muda\nNangka, potong²\n1 kaleng susu evaporasi\n200 gr gula pasir\n150 ml air matang",
    "langkahMemasak": "1. Cara membuat gula cair: Campur gula dan air matang, didihkan dengan air kecil sambil sesekali diaduk sampai gula larut. Dinginkan.\n2. Campur potongan alpukat dan kelapa muda, tambahkan susu evaporasi dan air kelapa, aduk rata. Beri larutan gula sedikit-sedikit sambil diaduk. Kalau dirasa sudah cukup manisnya, stop. Tambahkan es batu.",
    "namaGambar": "es_teler",
    "kategori": "Minuman"
  },
  {
    "namaResep": "Matcha Latte",
    "bahan": "2 sdt matcha powder\n50 ml air panas\n300 ml susu full cream\n60 ml simple syrup/madu SKM\n1 tray es batu",
    "langkahMemasak": "1. Ayak matcha powder. Lalu larutkan dengan air panas.\n2. Kocok matcha dengan bantuan chasen (jika menggunakan frother) sampai agak berbusa.\n3. Masukkan simple syrup & es batu ke dalam gelas. Tuang susu & larutan matcha. Aduk sebelum dikonsumsi.",
    "namaGambar": "matcha_latte",
    "kategori": "Minuman"
  },
  {
    "namaResep": "Iced Mochacino",
    "bahan": "160 ml susu UHT\n4 gram kopi bubuk instan\n2 sdm kental manis\n2 sdt bubuk coklat\n25 ml Air panas\n20 ml Air biasa\nSecukupnya es batu",
    "langkahMemasak": "1. Larutkan kopi bubuk instan ke dalam air biasa, aduk hingga larut.\n2. Larutkan coklat bubuk kedalam air panas lalu tambahkan 2sdm kental manis. Aduk hingga tercampur rata dan tidak ada yg menggumpal.\n3. Masukkan es batu ke dalam gelas, tuang susu kemudian larutan kopi dan terakhir larutan coklat. Aduk merata, iced moccacino siap dinikmati.",
    "namaGambar": "iced_mochacino",
    "kategori": "Minuman"
  },
  {
    "namaResep": "Orange Squash",
    "bahan": "2 sdm sirup orange\n1 irisan lemon (optional)\n250 ml air soda\n1/4 sdt Citric Acid Cap Gajah\nSecukupnya selasih\nSecukupnya Es Batu",
    "langkahMemasak": "1. Tuang sirup orange ke dalam gelas. Tambahkan es batu.\n2. Tuang air soda. Masukkan irisan lemon.\n3. Beri biji selasih secukupnya. Aduk-aduk lalu yang terakhir tambahkan citric acid cap gajah.\n4. Orange Squash with Citric Acid siap dinikmati.",
    "namaGambar": "orange_squash",
    "kategori": "Minuman"
  },
  {
    "namaResep": "Croissant Cokelat",
    "bahan": "Adonan Croissant (dingin) 500 gram\nSela Cokelat 80 - 100 gram (sekitar 15 gram per roti)\nKuning Telur 1 butir (sekitar 20 gram)\nSusu Cair UHT 1 sendok makan (sekitar 15 gram)\nAlmond Slice 25 - 40 gram",
    "langkahMemasak": "1. Keluarkan adonan dari kulkas, diamkan 5-10 menit di suhu ruang, lalu siapkan meja kerja dengan taburan sedikit tepung terigu.\n2. Gilas adonan menjadi lembaran panjang persegi setebal 3-4 mm, kemudian potong menjadi beberapa bagian berukuran sekitar 8 x 15 cm.\n3. Ambil satu potongan adonan, beri 1-2 sendok teh selai cokelat di salah satu ujungnya, lalu gulung dengan rapi.\n4. Susun gulungan adonan di atas loyang berlapis kertas roti, pastikan bagian sambungan berada di bawah dan beri jarak yang cukup antar adonan.\n5. Tutup loyang menggunakan plastik atau kain bersih, lalu diamkan (proofing) di suhu ruang selama 1.5 - 2.5 jam hingga ukurannya mengembang dua kali lipat.\n6. Saat proses proofing hampir selesai, panaskan oven hingga suhu 190°C dengan api atas-bawah.\n7. Olesi permukaan adonan yang sudah mengembang dengan egg wash secara merata, kemudian taburi dengan almond slice secukupnya.\n8. Panggang di dalam oven yang sudah panas selama 18-20 menit atau hingga warnanya kuning keemasan.\n9. Keluarkan dari oven dan biarkan dingin di atas rak pendingin sebelum siap untuk dinikmati.",
    "namaGambar": "croissant_cokelat",
    "kategori": "Cake dan Pastry"
  },
  {
    "namaResep": "Brownies Coklat Lumer",
    "bahan": "2 btr telur\n1 sdm gula pasir\n1/2 sdm baking powder\n2 sachet chocolatos drink\n10 sdm air\n8 sdm tepung terigu\n2 sdm coklat hitam\n1 pack keju oles\n1 sachet kental manis",
    "langkahMemasak": "1. Aduk cepat gula dan telur hingga gula larut, tambahkan baking powder dan tepung terigu aduk rata.\n2. Larutkan drink dengan air lalu tuangkan ke adonan tepung, aduk hingga tercampur rata.\n3. Campur keju oles dengan kental manis, sisihkan.\n4. Panaskan kukusan, tuang 1/4 bagian adonan kedalam cetakan puding yang kecil, kukus +-5 menit angkat lalu tuang adonan keju dan tutup dengan adonan bolu hingga cetakan penuh kukus lagi hingga matang +-10-12 menit api sedang.\n5. Tunggu sedikit dingin lalu keluarkan dari cetakan, beri toping keju oles diatasnya.",
    "namaGambar": "brownies_coklat_lumer",
    "kategori": "Cake dan Pastry"
  },
  {
    "namaResep": "Cheesecake Burnt",
    "bahan": "230 gr cream cheese\n2 butir telur\n100 ml whipping cream\n15 gr gula halus\n1 sdm tepung maizena\nVanilli extract",
    "langkahMemasak": "1. Masukkan semua bahan kedalam blender dan haluskan.\n2. Siapkan loyang bulat dan masukan adonan kedalam loyang yg sudah di alasi dengan baking paper dengan cara disaring.\n3. Panggang adonan selama 35-40 menit di suhu 220 derajat.\n4. Setelah matang diamkan cheesecakenya didalam chiller selama 6 jam, dan setelah 6 jam cheesecake sudah bisa dikeluarkan dari loyang dan dihidangkan.",
    "namaGambar": "cheesecake_burnt",
    "kategori": "Cake dan Pastry"
  },
  {
    "namaResep": "Matcha Lava Cake",
    "bahan": "120 gr unsalted butter\n145 gr White Chocolate\n75 gr Tepung Terigu Protein Rendah\n100 gr Gula Kastor\n10 gr Matcha Powder\nSejumput Garam\n3-4 btr Telur (195gr)",
    "langkahMemasak": "1. Lelehkan coklat dan butter, sisihkan.\n2. Campur tepung - gula - garam - matcha powder, aduk rata kemudian ayak.\n3. Tambahkan telur bertahap sambil di-whisk kemudian campurkan coklat dan butter (mencampur adonan coklat dan butter tidak boleh terlalu panas, usahakan pakai termometer, kira2 40-50°C), aduk hingga rata.\n4. Masukkan ke dalam kulkas (selama 1 jam atau kalian bisa simpan adonan selama 2 hari di kulkas sebelum di panggang).\n5. Tuang adonan ke cetakan (oles cetakan dengan butter dan terigu) sebanyak 3/4 dan panggang selama 8-11 menit pada suhu 190°C, (sesuaikan dengan oven masing²).\n6. Sajikan langsung setelah di panggang.",
    "namaGambar": "matcha_lava_cake",
    "kategori": "Cake dan Pastry"
  },
  {
    "namaResep": "Red Bean Pastry",
    "bahan": "5 pcs puff pastry ukuran 12*12\n1 butir kuning telur\nsecukupnya Pasta kacang merah\nPasta kacang Merah\nsecukupnya Gula pasir untuk toping",
    "langkahMemasak": "1. Siapkan bahan-bahan, jangan lupa berikan supaya hasilnya maksimal dan disukai keluarga tercinta. Ambil selembar puff pastry lalu isi dengan pasta kacang merah, dan lipat segitiga.\n2. Tekan bagian ujung-ujung puff pastry dengan garpu lalu oles dengan kuning telur dan tabur gula pasir.\n3. Oven selama 20 menit dengan suhu 180 derajat celcius atau sesuaikan oven masing-masing. Jangan lupa dipanaskan dulu oven 10 menit ya, sajikan sebagai cemilan favorit keluarga.",
    "namaGambar": "red_bean_pastry",
    "kategori": "Cake dan Pastry"
  },
  {
    "namaResep": "Cromboloni",
    "bahan": "2 lembar danish pastry instan\n250 gr Coklat filling\n100 gr Dcc leleh\nTaburan almond slice & coklat chips",
    "langkahMemasak": "1. Pipihkan adonan danish pastry kurleb 1 cm, potong dengan lebar 3-4 cm panjang 30-40cm cm.\n2. Gulung perlahan dan rapikan, masukkan ke dalam ring diameter 8 cm istirahatkan kurleb 20 menit hingga sedikit mengembang / timpa adonan dg loyang yg diberi pemberat sehingga tidak hingga mengembang ke atas.\n3. Oven 200 derajat api atas bawah (pre heat lebih dulu) tetap d timpa dg loyang agar selama pemanggangan tidak mengembang k atas, dmenit ke 25, lepaskan loyang & ring cutter cetakan, tambahkan pengovenan kurleb 5 menit hingga kecoklatan dan permukaan crunchy.\nTunggu dingin kemudian lubangi salah satu sisinya dan isi dg isian, celup dalam dcc yg sudah di lelehkan, taburi toping dan siap dihidangkan.",
    "namaGambar": "cromboloni",
    "kategori": "Cake dan Pastry"
  },
  {
    "namaResep": "Banana Pudding",
    "bahan": "4 bh pisang barangan\n5 sdm gula pasir\n1/2 sdt garam\n1 sachet agar2 bubuk\n1 sdm tepung maizena\n1 sdt perasa vanilla\nsecukupnya Perwana makanan\n450 ml santan",
    "langkahMemasak": "1. Siapkan bahan2.\n2. Potong pisang jadi2, lalu masukkan ke panci. Tambahkan gula, tepung maizena, garam.\n3. Tambahkan agar2, dan susu. Lalu aduk rata hingga tercampur rata. Masak hingga mendidih.\n4. Dinginkan sebentar, agar uap menghilang. Masukkan ke dalam cetakan, biarkan membeku.\n5. Sajikan.",
    "namaGambar": "banana_pudding",
    "kategori": "Pudding dan Custard"
  },
  {
    "namaResep": "Matcha PannaCotta",
    "bahan": "200 gr whipcream\n200 ml susu\n8 gr gelatin powder (bloom)\n70 gr gula\n1 sdt pasta vanilla\n5 gr matcha powder",
    "langkahMemasak": "1. Campur susu, cream, gula.\n2. Masa shimmer, tambahkan gelatin yg sudah di blooming.\n3. Larutkan matcha.\n4. Campurkan dg susu cream. Saring.\n5. Tuang cetakan. Dinginkan. Hias.",
    "namaGambar": "matcha_pannacotta",
    "kategori": "Pudding dan Custard"
  },
  {
    "namaResep": "Chia Pudding",
    "bahan": "2 sdm chia seed\n100 ml susu cair\nSecukupnya buah naga\nSecukupnya trail mix",
    "langkahMemasak": "1. Masukkan chia seed ke dalam gelas.\n2. Tuang susu cair dan aduk rata. Diamkan minimal 1 jam di dalam kulkas.\n3. Beri potongan buah naga dan trail mix sebagai toping.",
    "namaGambar": "chia_pudding",
    "kategori": "Pudding dan Custard"
  },
  {
    "namaResep": "Creme brulee",
    "bahan": "4 btr Kuning Telur\n60 gr Gula Pasir (sy pakai gula halus)\nGula Halus (homemade)\n500 ml Susu UHT\n1 sdt Vanilla (sy skip)\nToping Karamel\n8 sdm Gula Pasir",
    "langkahMemasak": "1. Siapkan Bahan.\n2. Aduk rata kuning telur dan gula halus.\n3. Masak Susu UHT dengan api sedang hingga ada gelembung di pinggiran panci lalu matikan api.\n4. Tuang sedikit susu ke adonan telur aduk cepat lalu pindahkan kembali ke adonan susu aduk lagi masak sampai sedikit mengental.\n4. Lalu tuang ke ramekin atau cup foil secukupnya.\nTata di atas loyang yang telah di beri air panas.\nPanggang di suhu 160° C selama 30 menit. 'Sesuaikan dengan oven masing²'.\n5. Jika sudah suhu ruang, simpan ke dalam kulkas minimal 3 Jam lalu beri sedikit gula pasir gosongkan atasnya dengan gun torch atau sendok yg telah di panaskan sebelumnya. Creme Brulee siap dinikmati.",
    "namaGambar": "creme_brulee",
    "kategori": "Pudding dan Custard"
  },
  {
    "namaResep": "Strawberry Bavarois",
    "bahan": "7 gr agar-agar strawberry (1 bks)\n40 gr SKM (sy 50 gr)\n4 buah strawberry\n400 ml strawberry juice\n50 gr gula pasir (sy lebih sesuai selera dan tingkat kemanisan)\n3 butir putih telur\n2 gr garam\n1/2 sdt cream of tar tar (koepoe)",
    "langkahMemasak": "1. Masukan agar-agar, SKM, strawberry juice, gula pasir, garam, aduk sampai mendidih.\n2. Setelah mendidih, matikan api. Mixer putih telur dan cream of tartar hingga mengembang kaku.\n3. (Agar-agar tidak boleh dingin ataupun masih panas, jd hrs keadaan hangat). Masukan adonan putih telur tadi kedalam agar-agar. Aduk dengan balloon whisk.\n4. Setelah tercampur rata, tuang dalam cetakan dan masukan kedalam kulkas.\n5. Strawberry bavarois siap santappp....",
    "namaGambar": "strawberry_bavarois",
    "kategori": "Pudding dan Custard"
  },
  {
    "namaResep": "Cheese custrad puff",
    "bahan": "5 lembar Puff Pastry mini instan\n1 butir Kuning Telur\n2 bungkus My Vla vanilla\n1/2 kotak Keju di Parut\n350 ml Susu Cair Panas\n3 keping biskuit oprional, potong kecil sebagai topping",
    "langkahMemasak": "1. Ambil 1 lembar puff pastry potong kotak menjadi beberapa bagian.\n2. Sebagian di lubangi tengah nya, kemudian tumpuk keatas pastry yang utuh tadi, gunakan kuning telur sebagai lem.\n3. Lakukan pada semua pastry, kemudian tata dalam loyang, oven selama kurang lebih 25 menit di suhu 200° hingga mengembang dan matang, sesuaikan oven masing-masing.\n4. Sementara menunggu, campur keju parut dengan my vla, aduk merata kemudian tuang susu panas sambil diaduk terus hingga mengental dan mendapatkan tekstur yang diinginkan.\n5. Masukkan dalam plastik segi tiga, sisihkan.\n6. Setelah matang keluarkan dari oven, biarkan hangat kemudian tekan bagian tengah pastry yang telah di oven td.\n7. Masukkan vla kebagian tengah pastry, lakukan pada semua pastry, beri topping, siap dinikmati.",
    "namaGambar": "cheese_custard_puff",
    "kategori": "Pudding dan Custard"
  },
  {
    "namaResep": "Smoothie bowl",
    "bahan": "Buah naga 1/2 potong\nBuah pisang ukuran besar 1/2 potong\nBuah strawberry (topping)\n1/2 potong buah pisang (topping)\nChoco Granola (topping)",
    "langkahMemasak": "1. Potong dan kupas buah naga, pisang, dan strawberry.\n2. Pisahkan antara buah yang ingin di mix dan yg akan menjadi topping.\n3. Blender 1/2 buah naga dan 1/2 buah pisang.\n4. Tambahkan susu cair sampai teksturnya kental/agak cair sesuai selera masing-masing.\n5. Tuang smoothie ke dalam mangkuk, hias dengan topping sesuai selera.",
    "namaGambar": "smoothie_bowl",
    "kategori": "Hidangan Buah"
  },
  {
    "namaResep": "Salad buah",
    "bahan": "3 buah apel boleh di kupas, boleh tidak\n1/4 buah anggur\n1/2 buah melon\n1 buah mangga\nPudding plain atau bebas\nKeju parut\nMayonaise\nbuah Yogurt plain atau boleh juga yg varian\nsecukupnya Skm",
    "langkahMemasak": "1. Potong semua buah-buahan dan jelly.\n2. Untuk kuah saladnya campurkan mayo, yogurt dan skm kemudian aduk sampai rata.\n3. Lalu campurkan buah ke dalam kuahnya.\n4. Kemudian salad buah siap dinikmati atau bisa disimpan terlebih dulu di dalam kulkas.",
    "namaGambar": "salad_buah",
    "kategori": "Hidangan Buah"
  },
  {
    "namaResep": "Pizza buah",
    "bahan": "Bahan Roti\n250 gram tepung terigu protein tinggi\n100 ml air (menyesuaikan)\n1/2 sdm Fermipan\n1 butir telur\n2 sdm margarin\n1 1/2 sdm gula pasir\nTopping\nSecukupnya selai (me ga ada)\nSecukupnya messes (optional)\nSecukupnya buah (bebas asal tidak terlalu berair)",
    "langkahMemasak": "1. Siapkan semua bahan.\n2. Campur bahan adonan kering. Lalu masukkan telur. Aduk lalu masukkan air. Setelah merata masukkan margarin dan uleni hingga kalis.\n3. Diamkan adonan. Sembari menunggu, potong² buah tipis-tipis saja.\n4. Bentuk adonan jadi pipih lalu hiasi dengan selai, messes, dan buah. Diamkan hingga sedikit mengembang.\n5. Panggang di teflon atau oven hingga matang. Siap disajikan.",
    "namaGambar": "pizza_buah",
    "kategori": "Hidangan Buah"
  },
  {
    "namaResep": "Pie Buah",
    "bahan": "Kulit pie :\n750 gr tepung terigu protein sedang\n450 gr margarin\n7 sdm gula halus\n1/4 sdt garam\n8 sdm Air matang\nVla :\n1 liter susu uht\n2 butir kuning telur\n200 gr gula pasir\n100 gr tepung maizena\n1 sdm tepung terigu\n1 sdt vanili cair\n3 sdm margarin\nsesuai selera Buah-buahan\nOlesan agar :\n1 sdt agar bubuk\n100 ml air\n3 sdm gula pasir",
    "langkahMemasak": "1. Kulit pie: campur tepung terigu, gula halus, margarin peram aduk sampai berpasir. Kemudian masukkan air secara bertahap sambil di uleni sampai tercampur rata. Bulat-kan adonan timbang masing-masing 20-23 gr.\n2. Cetak dalam cetakan pie. Oven dengan suhu 160°c selama 20 menit.\n3. Setelah matang, tunggu sampai hangat baru keluar kan dari cetakan.\n4. Vla : campur susu uht, gula pasir, tepung maizena, telur, vanili cair. Aduk sampai semua tercampur rata saring bila perlu, nyalakan kompor masak vla sampai mengental kecilkan api masukkan margarin aduk kembali sampai meletu.\n5. Penyelesaian: masukkan vla ke dalam kulit pie, hias dengan buah di atas nya. Lakukan sampai selesai, sisihkan.\n6. Olesan agar: Campur sambil di aduk, air, agar-agar bubuk, gula pasir. Masak sampai mendidih. Kemudian oleskan di atas pie buah.",
    "namaGambar": "pie_buah",
    "kategori": "Hidangan Buah"
  },
  {
    "namaResep": "Sop Buah",
    "bahan": "1 buah Alpukat\n1 buah Apel\n1 buah Strawberry\nSecukupnya Semangka & Anggur\n250 ml Susu full cream\n1 sachet SKM putih\n1 sdm selasih, rendam air hangat\nSecukupnya es batu",
    "langkahMemasak": "1. Cuci buah-buahan. Kemudian potong sesuai selera.\n2. Siapkan mangkuk besar. Tuangkan susu full cream & SKM lalu aduk rata.\n3. Tambahkan buah-buahan yang sudah di potong, biji selasih dan es batu. Aduk hingga tercampur rata.\n4. Es buah bisa langsung di sajikan.\n5. Bisa tambahkan sirup Coco pandan secukupnya untuk yang suka manis.",
    "namaGambar": "sop_buah",
    "kategori": "Hidangan Buah"
  },
  {
    "namaResep": "Daifuku Mochi",
    "bahan": "50 g Tepung beras\n100 ml Susu UHT\n2 tetes Pewarna makanan\n10 g Blue Band (mentega)\nsejumput Garam\n40 g Whipcream siap pakai\nsecukupnya Strawberry atau buah lain (misal mangga)",
    "langkahMemasak": "1. Campurkan tepung beras, susu UHT, dan garam dalam wadah tahan panas.\n2. Kukus adonan selama 20 menit hingga matang.\n3. Tambahkan pewarna makanan, aduk rata.\n4. Angkat adonan, uleni dengan Blue Band hingga kalis.\n5. Bagi adonan, timbang, lalu pipihkan.\n6. Masukkan whipcream (yang sudah dibekukan di freezer) dan potongan buah ke tengah adonan.\n7. Bungkus dan bulatkan mochi hingga isian tertutup rapat.",
    "namaGambar": "daifuku_mochi",
    "kategori": "Hidangan Buah"
  },
  {
    "namaResep": "Donat",
    "bahan": "250 gram tepung terigu\n5 gram ragi instan\n25 gram gula pasir\n3 gram garam\n2 kuning telur\n120 ml atau gram air atau susu dingin\n30 gram mentega tawar\nMinyak secukupnya untuk menggoreng\nGula bubuk secukupnya untuk taburan donat",
    "langkahMemasak": "1. Campurkan tepung terigu, ragi, dan gula pasir selama 1 menit untuk menghindari kontak langsung ragi dengan garam.\n2. Tambahkan garam dan kuning telur ke dalam campuran, aduk dengan spatula hingga rata, lalu tuangkan air sedikit demi sedikit hingga adonan terbentuk.\n3. Masukkan mentega tawar dan aduk hingga adonan menjadi kalis.\n4. Bulatkan adonan dan diamkan selama 30 menit.\n5. Bagi adonan menjadi 35 gram per potong, bulatkan, dan diamkan kembali selama 15 menit.\n6. Pipihkan adonan, taburi dengan tepung agar tidak lengket, atau gunakan kertas roti untuk memudahkan pengangkatan. Lubangi tengah adonan menggunakan spuit dan biarkan selama sekitar 25-30 menit sebelum menggoreng.\n7. Goreng donat di dalam fry pan yang telah mengembang dalam minyak panas dengan api kecil selama 2,5 menit hingga berwarna kuning kecoklatan. Angkat dan tiriskan.\n8. Setelah tiris dan tidak terlalu panas, balurkan donat dengan gula bubuk. Donat siap disajikan.",
    "namaGambar": "donat",
    "kategori": "Cemilan"
  },
  {
    "namaResep": "Churros",
    "bahan": "Bahan:\n250 gram Tepung terigu protein rendah Gatotkaca\n90 gram Mentega\n360 ml Air\n30 gram Gula pasir\n8 gram Garam\n4 butir Telur\nBahan Saus Coklat:\n100 gram Coklat\n50 gram Susu full cream cair\nBahan Taburan:\n100 gram Gula kastor\n5 gram Bubuk kayumanis",
    "langkahMemasak": "Cara Membuat:\n1. Masak air, mentega, gula pasir, dan garam hingga larut dan mendidih.\n2. Kecilkan api tambahkan terigu Gatotkaca, aduk hingga semua bahan tercampur rata.\n3. Dinginkan adonan, kemudian tambahkan satu persatu telur, aduk hingga rata dan telur habis.\n4. Sajikan minyak panas dan api sedang.\n5. Masukan adonan churros ke dalam plastik segitiga dengan nozel no 4B.\n6. Piring adonan churros sepanjang 10 cm kemudian gunting di atas minyak.\n7. Goreng hingga churros berwarna kecoklatan dan matang.\n8. Setelah matang baluri dengan campuran gula castor dan bubuk kayu manis.\nCara Membuat Saus Coklat:\n9. Panaskan susu, tuang ke dalam coklat yang sudah dicincang.\n10. Aduk hingga rata.\nPenyelesaian:\n11. Sajikan churros dengan saus coklat.",
    "namaGambar": "churros",
    "kategori": "Cemilan"
  },
  {
    "namaResep": "Martabak Manis",
    "bahan": "225 gr Terigu serbaguna\n20 gr maizena\n40 gr gula pasir\n325 ml air suhu ruang\nSejumput garam\n1/2 sdt peres baking powder\n1/2 sdt Peres soda kue\n1 btr telur\nTopping:\nSkim gold cheese\nSeres coklat\nKeju Cheddar parut\nMargarin palmia royal",
    "langkahMemasak": "1. Campur terigu, maizena, garam, gula dan air aduk rata / mixer (adonan halus tekstur gak encer gak kental) jika dirasa masih berat/kental saat diaduk bisa ditmbh air lagi sedikit.\n2. Masukan telur, baking soda dan baking powder aduk rata.\n3. Diamkan adonan selama 1 jam.\n4. Panaskan cetakan dengan api kecil, masukan adonan bahkan sampai berpori (jgn ditutup) sampai adonan mentah masak / taburi gula tutup sebentar.\n5. Angkat martabak olesi dengan mentega dan taburi toping yang diinginkan.",
    "namaGambar": "martabak_manis",
    "kategori": "Cemilan"
  },
  {
    "namaResep": "Cantik Manis",
    "bahan": "95 gr tepung hunkwe\n75 gr mutiara\n600 ml santan\n150 gr gula pasir\n1 lbr pandan\nSecukupnya skm\nSejumput garam\nVanili",
    "langkahMemasak": "1. Rebus mutiara hingga matang, tiriskan.\n2. Bagi dua santan.\nMasukan daun pandan, gula, garam, vanili kedalam satu bagian santan, tuang kedalam wajan dan masak hingga mendidih.\nLarutkan Hunkwe dg satu bagian santan yg lain, aduk hingga larut.\nTuang Hunkwe kedalam santan yg mendidih aduk cepat hingga kental.\n3. Masukkan mutiara yg sudah ditiriskan kedalam adonan, aduk hingga meletup letup. Matikan api.\n4. Oles cetakan dg sedikit minyak, tuang adonan Hunkwe kedalam cetakan. Dinginkan.\n5. Lepas kue dari cetakan dan sajikan.",
    "namaGambar": "cantik_manis",
    "kategori": "Cemilan"
  },
  {
    "namaResep": "Kue Sus",
    "bahan": "200 ml air putih\n125 gram margarin\n1 sdm gula pasir\n1/2 sdt garam\n150 gram tepung terigu\n3 butir telur\nSecukupnya whipped cream home made",
    "langkahMemasak": "1. Campurkan margarin, air, gula, dan garam. Masak hingga semua bahan larut. Masukkan tepung terigu campur hingga kalis. Diamkan hingga suhu ruang.\n2. Miring adonan yang sudah suhu ruang dengan satu per satu telur. Masukkan adonan ke pipping bag.\n3. Alasi loyang dengan baking paper lalu spuit adonan. Panggang di suhu 200° C api atas bawah selama 30 menit. Angkat dan keluarkan tunggu hingga dingin.\n4. Lubangi bagian bawah kue dengan sumpit lalu isi dengan whipping cream home made yang sudah dimasukkan ke pipping bag.\n5. Taburi gula halus dan bubuk kayu manis yang disaring di atas kue. Kue siap dihidangkan.",
    "namaGambar": "kue_sus",
    "kategori": "Cemilan"
  },
  {
    "namaResep": "Kue cubit",
    "bahan": "1 Butir telur\n4 SDM gula\n14 SDM terigu\n130 ml susu cair\n2 SDM margarin dilelehkan\n1 Saset vanili bubuk\n1/2 sdt garam\n1/2 sdt baking powder\n1/2 sdt soda kue\n3 SDM mesis untuk toping",
    "langkahMemasak": "1. Aduk telur dan gula sampai larut, lalu masukkan susu dan tepung bertahap. Aduk rata lalu masukkan semua bahan kecuali mesis. Diamkan adonan 10menit sblm dicetak.\n2. Panaskan cetakan. Ambil 1 SDM adonan, tuang kedalam cetakan yg sudah panas, tunggu gelembung gelembung pecah lalu taburi mesis dan tutup cetakan, tunggu sampai matang.",
    "namaGambar": "kue_cubit",
    "kategori": "Cemilan"
  }
]